external/swak/examples/groovyBC/sprinklingInlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    hole
    {
      type    groovyBC;
      value   uniform (0 0 0);
      variables (
          "vel=10.0;"
          "width=max(pos().x)-min(pos().x);"
          "height=max(pos().y)-min(pos().y);"
          "rad=width*0.5;"
          "pi=3.1415926;"
          "rps=1.0;"
          "alph=pi+time()*2.0*pi*rps;"
          "posx=cos(alph)*rad;"
          "posy=sin(alph)*rad;"
          "velX=cos(alph)*vel;"
	  "velY=sin(alph)*vel;"
	  "vecU=vector(velX,velY,0);"
	  "vec0=vector(0,0,0);"
	  "distW=width*0.1;"
       );
       valueExpression
//           "(pos().x>posx-distW)&&(pos().x<posx+distW)&&(pos().y<posy+distW)&&(pos().y>posy-distW)?vecU:vec0"
             "(posy<0)?((pos().x>posx-distW)&&(pos().x<posx+distW)&&(pos().y<posy+distW)&&(pos().y>posy-distW)?vecU:vec0):((pos().x>posx-distW)&&(pos().x<posx+distW)&&(pos().y<(-posy)+distW)&&(pos().y>(-posy)-distW)?vector(velX,-velY,0):vec0)"
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
